#+TITLE: Plan for Running cluster automation with setup-ovpl on local machine.
#+AUTHOR: VLEAD
#+DATE: [2017-09-12 Tue]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export

* Introduction
  This document contains the realization plan for automating
   VLEAD's infrastructure using OpenVZ and ADS.  This
   automation is realized as series of [[https://github.com/vlead/lab-data-service/milestones?state=closed][milestones]].

* Milestone Snapshot 
   |---+----+----+-----+--------------------------------------------+------+--------+-----+-----+--------|
   |   | S. | Mi | Req | Milestone                                  | Plan | Status | Est | Act | Issues |
   |   | no | no | Map |                                            |      |        | hrs | hrs |        |
   |---+----+----+-----+--------------------------------------------+------+--------+-----+-----+--------|
   |   | 1. | 1. |     | [[https://gitlab.com/vlead-systems/cluster-automation/milestones/5][OpenVZ cluster automation on local machine]] |      | Open   | 84  | 71  | [[https://gitlab.com/vlead-systems/cluster-automation/issues?scope=all&utf8=%E2%9C%93&state=opened&milestone_title=Setup%20OpenVZ%20cluster%20automation%20on%20local%20machine][ref]]    |
   |---+----+----+-----+--------------------------------------------+------+--------+-----+-----+--------|
   |   |    |    |     |                                            |      |        |     |     |        |
   |---+----+----+-----+--------------------------------------------+------+--------+-----+-----+--------|
   |   |    |    |     | Total                                      |      |        | 84  | 71  |        |
   | ^ |    |    |     |                                            |      |        | et  | at  |        |
   |---+----+----+-----+--------------------------------------------+------+--------+-----+-----+--------|
  #+TBLFM: $2=@#+1
  #+TBLFM: @3$8=remote(ads-configuration, $Estimated)
  #+TBLFM: @3$9=remote(ads-configuration, $Actual)
  #+TBLFM: $et=vsum(@II+1..@-1)
  #+TBLFM: $at=vsum(@II+1..@-1)

* Detailed Plans
** [[https://gitlab.com/vlead-systems/cluster-automation/milestones/5][Milestone:: OpenVZ cluster automation on local machine]] 

#+caption:  realization-plan
#+name: ads-configuration
|---+-------+--------------------------------------------------+--------+-----------+--------+------------------+------------------+-------------+------------|
|   |    S. | Tasks                                            | Github |  Expected | Actual |        Estimated |           Actual | Status      | Assignee   |
|   |    NO |                                                  | Issues |    Effort | Effort |           Start/ |           Start, |             |            |
|   |       |                                                  |        |       (in |    (in |              End |              End |             |            |
|   |       |                                                  |        |    person | person |            Dates |            Dates |             |            |
|   |       |                                                  |        |    hours) | hours) |                  |                  |             |            |
|---+-------+--------------------------------------------------+--------+-----------+--------+------------------+------------------+-------------+------------|
|   |    1. | Install centos-6.9 os                            | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |         8 |      5 |       09-09-2017 |       11-09-2017 | Done        | Raghupathi |
|   |       | and required packages                            |        |           |        |       11-09-2017 |       11-09-2017 |             |            |
|   |       | for cluster automation                           |        |           |        |                  |                  |             |            |
|---+-------+--------------------------------------------------+--------+-----------+--------+------------------+------------------+-------------+------------|
|   |    2. | Prepare ansible script to                        | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |         4 |      3 |       12-09-2017 |       12-09-2017 | Done        | Raghupathi |
|   |       | install OpenVZ without                           |        |           |        |       13-09-2017 |       13-09-2017 |             |            |
|   |       | install dependecies and mongodb                  |        |           |        |                  |                  |             |            |
|   |       | using setup-centos repo                          |        |           |        |                  |                  |             |            |
|---+-------+--------------------------------------------------+--------+-----------+--------+------------------+------------------+-------------+------------|
|   |    3. | Prepare ansible script to                        | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |         4 |      3 |       12-09-2017 |       12-09-2017 | Done        | Raghupathi |
|   |       | install dependencies without                     |        |           |        |       13-09-2017 |       13-09-2017 |             |            |
|   |       | OpenVZ using setup-centos repo                   |        |           |        |                  |                  |             |            |
|   |       | on Base4 container                               |        |           |        |                  |                  |             |            |
|---+-------+--------------------------------------------------+--------+-----------+--------+------------------+------------------+-------------+------------|
|   |    4. | Prepare ansible script to                        | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |         8 |      4 |       13-09-2017 |       13-09-2017 | Done        | Raghupathi |
|   |       | install tornado-4.3 on Base4 container           |        |           |        |       14-09-2017 |                  |             |            |
|---+-------+--------------------------------------------------+--------+-----------+--------+------------------+------------------+-------------+------------|
|   |    5. | Update ansible scripts                           | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |        24 |     10 |       13-09-2017 |       24-09-2017 | Done        | Raghupathi |
|   |       | to run playbooks on hostmache                    |        |           |        |       22-09-2017 |                  |             |            |
|---+-------+--------------------------------------------------+--------+-----------+--------+------------------+------------------+-------------+------------|
|   |    6. | Adding base-machine-setup.yml,                   | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |         5 |      3 |       24-09-2017 |       25-09-2017 | Done        | Raghupathi |
|   |       | ads.yml and tornado.yml files into               |        |           |        |       25-09-2017 |                  |             |            |
|   |       | cluster automation machine implementation        |        |           |        |                  |                  |             |            |
|   |       | yml files                                        |        |           |        |                  |                  |             |            |
|---+-------+--------------------------------------------------+--------+-----------+--------+------------------+------------------+-------------+------------|
|   |    7. | Run bootstrap.sh script on local machine         | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |         4 |      3 |       25-09-2017 |       25-09-2017 | Done        | Raghupathi |
|   |       |                                                  |        |           |        |       25-09-2017 |                  |             |            |
|---+-------+--------------------------------------------------+--------+-----------+--------+------------------+------------------+-------------+------------|
|   |    8. | Deploy a lab on local machine using ADS service. | [[https://gitlab.com/vlead-systems/cluster-automation/issues/20][#20]]    |         3 |      8 |       25-09-2017 |                  |             |            |
|   |       |                                                  |        |           |        |       02-10-2017 |       02-10-2017 | Done        | Raghupathi |
|---+-------+--------------------------------------------------+--------+-----------+--------+------------------+------------------+-------------+------------|
|   |    9. | Install OpenVZ using ansible script              |        |         8 |     16 |       26-10-2017 |       26-10-2017 | Done        | Raghupathi |
|   |       | on host machine                                  | [[https://gitlab.com/vlead-systems/cluster-automation/issues/22][#22]]    |           |        |       26-10-2017 |       26-10-2017 |             |            |
|   |       |                                                  |        |           |        |                  |                  |             |            |
|---+-------+--------------------------------------------------+--------+-----------+--------+------------------+------------------+-------------+------------|
|   |   10. | Install dependecies                              | [[https://gitlab.com/vlead-systems/cluster-automation/issues/23][#23]]    |         8 |     16 | [2017-10-25 Wed] | [2017-10-27 Fri] | Done        | Siva &     |
|   |       | on ADS container                                 |        |           |        |                  | [2017-10-30 Mon] |             | Raghupathi |
|---+-------+--------------------------------------------------+--------+-----------+--------+------------------+------------------+-------------+------------|
|   |   11. | Configure ADS using                              | [[https://gitlab.com/vlead-systems/cluster-automation/issues/23][#23]]    |         8 |        | [2017-11-01 Wed] | [2017-11-01 Wed] | In progress | Siva &     |
|   |       | ansible scripts                                  |        |           |        |                  |                  |             | Raghupathi |
|---+-------+--------------------------------------------------+--------+-----------+--------+------------------+------------------+-------------+------------|
|   | Total |                                                  |        |        84 |     71 |                  |                  |             |            |
| ^ |       |                                                  |        | Estimated | Actual |                  |                  |             |            |
|---+-------+--------------------------------------------------+--------+-----------+--------+------------------+------------------+-------------+------------|
#+TBLFM: $2=@#+1
#+TBLFM: $Estimated=vsum(@II+1..@-1)
#+TBLFM: $Actual=vsum(@II+1..@-1)




